/**
 * aaencode - Encode any JavaScript program to Japanese style emoticons (^_^)
 * http://utf-8.jp/public/aaencode.html
 * (c) Yosuke Hasegawa
 */
global.AAENCODE = METHOD({

	run : function(text) {
		'use strict';
		//REQUIRED: text
		
		var
		// emoticons
		emoticons = [
			'(c^_^o)',
			'(ﾟΘﾟ)',
			'((o^_^o) - (ﾟΘﾟ))',
			'(o^_^o)',
			'(ﾟｰﾟ)',
			'((ﾟｰﾟ) + (ﾟΘﾟ))',
			'((o^_^o) +(o^_^o))',
			'((ﾟｰﾟ) + (o^_^o))',
			'((ﾟｰﾟ) + (ﾟｰﾟ))',
			'((ﾟｰﾟ) + (ﾟｰﾟ) + (ﾟΘﾟ))',
			'(ﾟДﾟ) .ﾟωﾟﾉ',
			'(ﾟДﾟ) .ﾟΘﾟﾉ',
			'(ﾟДﾟ) [\'c\']',
			'(ﾟДﾟ) .ﾟｰﾟﾉ',
			'(ﾟДﾟ) .ﾟДﾟﾉ',
			'(ﾟДﾟ) [ﾟΘﾟ]'
		],
		
		// result
		result = 'ﾟωﾟﾉ= /｀ｍ´）ﾉ ~┻━┻   //*´∇｀*/ [\'_\']; o=(ﾟｰﾟ)  =_=3; c=(ﾟΘﾟ) =(ﾟｰﾟ)-(ﾟｰﾟ); ',
		
		// others
		i, t, n, m;
		
		if (/ひだまりスケッチ×(365|３５６)\s*来週も見てくださいね[!！]/.test(text) === true){
			result += 'X=_=3; ';
			result += '\r\n\r\n	X / _ / X < \'来週も見てくださいね!\';\r\n\r\n';
		}
		
		result += '(ﾟДﾟ) =(ﾟΘﾟ)= (o^_^o)/ (o^_^o);' +
			'(ﾟДﾟ)={ﾟΘﾟ: \'_\' ,ﾟωﾟﾉ : ((ﾟωﾟﾉ==3) +\'_\') [ﾟΘﾟ] ' +
			',ﾟｰﾟﾉ :(ﾟωﾟﾉ+ \'_\')[o^_^o -(ﾟΘﾟ)] ' +
			',ﾟДﾟﾉ:((ﾟｰﾟ==3) +\'_\')[ﾟｰﾟ] }; (ﾟДﾟ) [ﾟΘﾟ] =((ﾟωﾟﾉ==3) +\'_\') [c^_^o];' +
			'(ﾟДﾟ) [\'c\'] = ((ﾟДﾟ)+\'_\') [ (ﾟｰﾟ)+(ﾟｰﾟ)-(ﾟΘﾟ) ];' +
			'(ﾟДﾟ) [\'o\'] = ((ﾟДﾟ)+\'_\') [ﾟΘﾟ];' +
			'(ﾟoﾟ)=(ﾟДﾟ) [\'c\']+(ﾟДﾟ) [\'o\']+(ﾟωﾟﾉ +\'_\')[ﾟΘﾟ]+ ((ﾟωﾟﾉ==3) +\'_\') [ﾟｰﾟ] + ' +
			'((ﾟДﾟ) +\'_\') [(ﾟｰﾟ)+(ﾟｰﾟ)]+ ((ﾟｰﾟ==3) +\'_\') [ﾟΘﾟ]+' +
			'((ﾟｰﾟ==3) +\'_\') [(ﾟｰﾟ) - (ﾟΘﾟ)]+(ﾟДﾟ) [\'c\']+' +
			'((ﾟДﾟ)+\'_\') [(ﾟｰﾟ)+(ﾟｰﾟ)]+ (ﾟДﾟ) [\'o\']+' +
			'((ﾟｰﾟ==3) +\'_\') [ﾟΘﾟ];(ﾟДﾟ) [\'_\'] =(o^_^o) [ﾟoﾟ] [ﾟoﾟ];' +
			'(ﾟεﾟ)=((ﾟｰﾟ==3) +\'_\') [ﾟΘﾟ]+ (ﾟДﾟ) .ﾟДﾟﾉ+' +
			'((ﾟДﾟ)+\'_\') [(ﾟｰﾟ) + (ﾟｰﾟ)]+((ﾟｰﾟ==3) +\'_\') [o^_^o -ﾟΘﾟ]+' +
			'((ﾟｰﾟ==3) +\'_\') [ﾟΘﾟ]+ (ﾟωﾟﾉ +\'_\') [ﾟΘﾟ]; ' +
			'(ﾟｰﾟ)+=(ﾟΘﾟ); (ﾟДﾟ)[ﾟεﾟ]=\'\\\\\'; ' +
			'(ﾟДﾟ).ﾟΘﾟﾉ=(ﾟДﾟ+ ﾟｰﾟ)[o^_^o -(ﾟΘﾟ)];' + 
			'(oﾟｰﾟo)=(ﾟωﾟﾉ +\'_\')[c^_^o];' +
			'(ﾟДﾟ) [ﾟoﾟ]=\'\\\'\';' + 
			'(ﾟДﾟ) [\'_\'] ( (ﾟДﾟ) [\'_\'] (ﾟεﾟ+(ﾟДﾟ)[ﾟoﾟ]+ ';
		
		for (i = 0; i < text.length; i += 1) {
			
			n = text.charCodeAt(i);
			t = '(ﾟДﾟ)[ﾟεﾟ]+';
			
			if (n <= 127) {
				t += n.toString(8).replace(/[0-7]/g, function(c) {
					return emoticons[c] + '+ ';
				});
			}
			
			else {
				m = /[0-9a-f]{4}$/.exec('000' + n.toString(16))[0];
				t += '(oﾟｰﾟo)+ ' + m.replace(/[0-9a-f]/gi, function(c) {
					return emoticons[parseInt(c, 16)] + '+ ';
				});
			}
			
			result += t;
		}
				
		result += '(ﾟДﾟ)[ﾟoﾟ]) (ﾟΘﾟ)) (\'_\');';
		
		return result;
	}
});